app/controllers/posts_controller.rb

  def show
    @comments = Comment.all
---
SELECT "comments".* FROM "comments"

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Nuevo Post"], ["content", "hola brina"], ["user_id", 21], ["created_at", "2018-08-02 00:59:53.646410"], ["updated_at", "2018-08-02 00:59:53.646410"]]